'Задача 1.1 - розраховуєм формулу'

# x = 5
# y = 6
# print(y / 2 ** 3 + x)

'Задача 1.2 - розраховуєм формулу вводячі числа (перший спосіб)'

# m = input('Введіть перше число ')
# n = input('Введіть друге число ')
# m = int(m)
# n = int(n)
# print(n / 2 ** 3 + m)

'Задача 1.3 - розраховуєм формулу вводячі числа (другий спосіб)'

# m = int(input('Введіть перше число '))
# n = int(input('Введіть друге число '))
# print(n / 2 ** 3 + m)

'Задача 2.1 - складаєм текст'

# text1 = 'life'
# text2 = 'is'
# text3 = 'beatiful'
# print(text1 + ' ' + text2 + ' ' + text3)

'Задача 2.2 - складаєм текст підставляючи вводимий в змінну текст та базовий'

# name = input('Як Вас зовуть? ')
# print(f'Добрий вечір, {name}')      # f' - повідомлюєм що всередині будуть подстановки у змінну name

'Задача 2.3 - складаєм текст з змінних у обраному порядку'

# text1 = 'life'
# text2 = 'is'
# text3 = 'beatiful'
# print(f'{text1} {text2} {text3}')

'Задача 3.1 - порівнюємо тексти'

# text1 = 'Тойота — японская автомобилестроительная корпорация, также предоставляющая финансовые услуги'
# text2 = 'Тойота — японская автомобилестроительная корпорация, также предоставляющая финансовые услуги'
# print(text1 == text2)

'Задача 3.2 - порівнюємо вводимі тексти'

# text1 = input('Твій текст 1: ')
# text2 = input('Твій текст 2: ')
# print(text1 == text2)

'Задача 3.3 - порівнюємо вводимі тексти з ассертом - показуэ де проблема'

# text1 = input('Твій текст 1: ')
# text2 = input('Твій текст 2: ')
# assert text1 == text2

'Задача 4.1 - розраховуєм формулу вводячі числа (перший спосіб)'

m = input('Введіть перше число ')
n = input('Введіть друге число ')
expected = input('Введіть очікуюваний результат: ')

m = int(m)
n = int(n)
expected = float(expected)      #використовуєм float бо відповідь розрахунку може бути не ціла

result = (n / 2 ** 3 + m)
print(result == expected)
assert result == expected








