
'Список - List'

'Список 1 - зчитуєм, змінєм, додаєм, друкуєм'
# my_list_1 = [1, 2, 5, 8, 10, 'text', False, 2.5]        #порядок від нуля, тобто перший елемент ('1') це 0. print(my_list_1[0])
# print(my_list_1[6])
# my_list_1[5] = 42       #кажем що тепер п'ятий елемент = 42 (перезапише будь який тип на те що ми задаєм)
# print(my_list_1)
#
# my_list_1.append('text')        #додаэм ще елемент (пишеться у кінець списка)
# print(my_list_1)
#
# for element in my_list_1:       #за допомогою цикла for друкуєм увесь список. Водночас присвоюєм змінну element кожному елементу списка
#     print(element)

'Список 2 - друкуєм з умовами до елементів за допомогою циклу For'
# numbers = [1, 2, 3, 5, 8, 10]
#
# for x in numbers:
#     if x > 3:         #якщо елемент більше 3-х помножити на 2 та друкувати
#         print(x * 2)
#     elif x > 2:         #якщо елемент більше 2-х помножити на 3 та друкувати
#         print(x * 3)
#     else:               #якщо елемент не більше 2-х та 3-х просто друкувати його
#         print(x)

'Кортеж - Tuple'        #в кортеже невозможно ничего изменить, его можно только перезаписать

# my_tuple = (1, 2, 5, 'text', False)
# print(my_tuple[3])          #печатаем элемент кортежа под индексом 3 (4-й в кортеже, счёт от 0-я)
#
# for element in my_tuple:
#     print(element)          #печатаем элементы кортежа по очереди при помощи цикла for
#
# my_tuple = (4, 5, 7)        #перезаписываем кортеж
# print(my_tuple)
#
# #my_tuple[2] = 42       #---изменение элемента кортежа невозможно таким образом

'Множина - Set'         #у множені неможна звертатись до елементів або їх перезаписувати (бо вони не храняться за індексом). Множина зберігає тільки унікальні значення

my_set = {1, 2, 5, 'text', False}
#print(my_set[2])       #---у множені неможна звертатись до елементів
#my_set[2] = 4           #---у множені неможна перезаписувати елементи
for element in my_set:
    print(element)          #виводяться у рандомному порядку

my_set2 = {1, False, 1, 2, 1, 5, 1, 1, 2, 5, 'text', False}     #Множина зберігає тільки унікальні значення
print(my_set2)

my_set2.add(1)          #    .add додає елемент, але тільки якщо такого елемента немає
print(my_set2)
my_set2.add(8)
print(my_set2)


'Словник - Dict'         #у словника є ключі та їх значення
# my_dict = {'name': 'Bob', 'age': 25, 'Nickname': 'Bunny'}          #зберігаються ключі та їх значення отак - {'name': 'Bob'}
# print(my_dict['name'])                                             #печатаєм ім'я
# print(my_dict)                                             #печатаєм словник з ключами та значеннями
# my_dict['age'] = 26                                             #змінюєм вік
# print(my_dict)
# my_dict['city'] = 'London'                                             #додаєм новий ключ та його значення
# print(my_dict)
#
# for element in my_dict:
#     print(element)                                             #печатаєм ключі
#
# for key in my_dict:
#     print(my_dict[key])                                        #печатаєм значення
#
# for key in my_dict:
#     print(key, my_dict[key])                                        #печатаєм ключ та значення
#     print(f'{key}: {my_dict[key]}')                                 #печатаєм ключ та значення але у більш красивій формі










